# PANDAS - DAY 3 ( TIPS AND TRICKS )

## Table of Contents:

[1. how-to-find-the-version](#01--how-to-find-the-version)\
[2. making-a-data-frame](#02--making-a-data-frame)\
[3. using-numpy-to-create-dataframe](#3--using-numpy-to-create-dataframe)\
[4. sing-template-data](#4-using-template-data)\
[5. using-your-own-data](#5-using-your-own-data)\
[6. reverse-row-order](#6-reverse-row-order)\
[7. reverse-colun-order](#7--reverse-colun-order)\
[8. select-a-cloumn-by-a-data-type](#8--select-a-cloumn-by-a-data-type)\
[9. convert-numbers-into-strings](#9--convert-numbers-into-strings)\
[10. reduce-dataframe-size](#10--reduce-dataframe-size)\
[11. copy-data-from-clipboard](#11--copy-data-from-clipboard)\
[12. split-data-sets-in-two-frames](#12---split-data-sets-in-two-frames)

### 01 . How to find the version?

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.5.3'

In [4]:
pd.show_versions()

c:\Users\Administrator\AppData\Local\Programs\Python\Python311\Lib\site-packages\_distutils_hack\__init__.py:33: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")

INSTALLED VERSIONS
------------------
commit           : 2e218d10984e9919f0296931d92ea851c6a6faf5
python           : 3.11.1.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22000
machine          : AMD64
processor        : Intel64 Family 6 Model 78 Stepping 3, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.5.3
numpy            : 1.24.2
pytz             : 2022.7.1
dateutil         : 2.8.2
setuptools       : 65.5.0
pip              : 23.1.2
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.2
IPython          : 8.13.2
pandas_datareader: None
bs4              : 4.11.2
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
matplotlib       : 3.7.1
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : 3.1.2
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : None
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None
tzdata           : None

### 02- Making a Data Frame

In [5]:
df=pd.DataFrame({'Name ':["Uzair","Abbas","Lahad","Razi","Bilal"],'Age ': [20,19,21,22,19]})

In [6]:
df

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [7]:
df.head()

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [8]:
df.tail()

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [9]:
df

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

# 3- using numpy to create dataframe

In [10]:
# numpy array to create dataframe
import numpy as np
arr=np.array([['Uzair',20],['Abbas',19],['Lahad',21],['Razi',22],['Bilal',19]])
# arr
df=pd.DataFrame(arr,columns=['Name','Age'])
df

    Name Age
0  Uzair  20
1  Abbas  19
2  Lahad  21
3   Razi  22
4  Bilal  19

In [11]:
# numpy array data frame
pd.DataFrame(np.random.rand(5,2))
pd.DataFrame(np.random.rand(5,2), columns=list("AB"))

          A         B
0  0.796553  0.136987
1  0.886822  0.086010
2  0.425182  0.753720
3  0.711406  0.013098
4  0.364513  0.254533

In [12]:
pd.DataFrame(np.random.rand(50,20))

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
0,0.184649,0.570095,0.223444,0.057349,0.454828,0.914559,0.389257,0.354255,0.269809,0.018536,0.377098,0.086133,0.114841,0.360927,0.196577,0.521097,0.282715,0.968615,0.518406,0.491586
1,0.815971,0.016116,0.213240,0.615817,0.073388,0.935382,0.610703,0.105651,0.864723,0.491150,0.931964,0.140186,0.034217,0.194900,0.195133,0.170754,0.155658,0.417881,0.277152,0.970216
2,0.990049,0.283631,0.112779,0.549682,0.528624,0.126062,0.913027,0.446130,0.291798,0.186868,0.769254,0.305349,0.507071,0.589045,0.354491,0.946768,0.670070,0.177125,0.184525,0.818178
3,0.654920,0.122106,0.235945,0.153935,0.089417,0.580369,0.898536,0.297166,0.623892,0.348647,0.309445,0.640563,0.518930,0.744758,0.615750,0.873932,0.601140,0.182568,0.850093,0.946643
4,0.173693,0.078365,0.926749,0.393318,0.875328,0.665699,0.073825,0.950951,0.446021,0.502247,0.093364,0.614602,0.855036,0.921010,0.849598,0.399498,0.152992,0.130434,0.963613,0.159349
5,0.638758,0.142601,0.273874,0.652464,0.372118,0.861429,0.620857,0.560578,0.042398,0.097248,0.861336,0.167880,0.253755,0.573698,0.351149,0.723487,0.523496,0.985549,0.081713,0.672632
6,0.313351,0.937945,0.558638,0.709989,0.588571,0.103836,0.092738,0.016619,0.595664,0.809297,0.177989,0.391847,0.042197,0.667592,0.298870,0.772901,0.703271,0.921255,0.702818,0.244685
7,0.073011,0.271101,0.665483,0.659643,0.663667,0.184240,0.120508,0.997994,0.191892,0.846195,0.106325,0.486256,0.699210,0.539679,0.337401,0.383849,0.247297,0.814781,0.560447,0.778403
8,0.095273,0.626586,0.908368,0.888501,0.314493,0.519268,0.284617,0.345644,0.084217,0.517751,0.578830,0.043218,0.694700,0.093752,0.663849,0.977172,0.589683,0.148803,0.176192,0.382189
9,0.634088,0.991959,0.869946,0.325751,0.685650,0.760828,0.471366,0.922662,0.622473,0.492103,0.678635,0.711044,0.809649,0.343134,0.813662,0.031296,0.391708,0.809868,0.612693,0.785403
10,0.035580,0.048471,0.128607,0.242263,0.898159,0.215442,0.582168,0.301974,0.669128,0.504884,0.707451,0.535467,0.894481,0.296087,0.175322,0.491358,0.203637,0.519882,0.978967,0.425982
11,0.528292,0.098873,0.544012,0.026565,0.816209,0.509085,0.657417,0.553402,0.861350,0.034348,0.106292,0.787358,0.940098,0.358323,0.707759,0.693363,0.227139,0.190663,0.681133,0.899111
12,0.781447,0.652551,0.750022,0.082389,0.836923,0.754355,0.111695,0.346327,0.682066,0.599999,0.965405,0.414812,0.819035,0.550408,0.982674,0.471848,0.344314,0.292506,0.075000,0.751110
13,0.436335,0.368142,0.588107,0.768377,0.454474,0.574324,0.169960,0.980922,0.534297,0.480396,0.443861,0.541903,0.425503,0.389996,0.060574,0.950084,0.906601,0.604098,0.928747,0.169626
14,0.643385,0.854165,0.596888,0.988283,0.662327,0.319107,0.928841,0.496686,0.252157,0.537620,0.649077,0.891075,0.965950,0.110711,0.919844,0.792610,0.169622,0.062067,0.886194,0.013090
15,0.865438,0.609180,0.123585,0.104608,0.546076,0.498088,0.537313,0.500167,0.696686,0.898694,0.341833,0.341600,0.799050,0.246495,0.430796,0.146027,0.024042,0.839504,0.830585,0.747412
16,0.621273,0.646326,0.088180,0.780547,0.163074,0.590113,0.663473,0.954477,0.827806,0.961139,0.125902,0.952273,0.932897,0.718804,0.868697,0.044908,0.948446,0.079176,0.219945,0.556715
17,0.119726,0.409463,0.709646,0.187557,0.335266,0.124028,0.442278,0.876592,0.464179,0.491252,0.930307,0.737184,0.171207,0.713832,0.862026,0.055981,0.673411,0.444320,0.594392,0.785677
18,0.187255,0.070820,0.162870,0.903313,0.041997,0.732944,0.348800,0.254562,0.335554,0.943348,0.777874,0.413616,0.225066,0.469424,0.876976,0.459879,0.380328,0.986980,0.937781,0.572415
19,0.120228,0.194906,0.217956,0.572771,0.771814,0.524315,0.619574,0.266873,0.612642,0.067114,0.983813,0.269970,0.515917,0.196288,0.980218,0.892597,0.099441,0.360867,0.093897,0.737381
20,0.285654,0.157039,0.477728,0.870999,0.936678,0.794646,0.361516,0.912978,0.402596,0.667019,0.047378,0.278347,0.723453,0.441017,0.214386,0.241618,0.922255,0.834541,0.680062,0.233061
21,0.915306,0.446638,0.095001,0.634631,0.035960,0.148432,0.050577,0.876789,0.144131,0.945665,0.314196,0.330755,0.419868,0.658295,0.590601,0.408635,0.625331,0.025265,0.486536,0.168789
22,0.299534,0.554544,0.217193,0.463831,0.983532,0.673337,0.520753,0.669475,0.164980,0.630564,0.159125,0.438255,0.423551,0.942962,0.413155,0.145664,0.994319,0.875951,0.149833,0.266271
23,0.196890,0.317269,0.277936,0.851382,0.078789,0.198208,0.087641,0.687436,0.020962,0.552334,0.387859,0.509468,0.904511,0.439221,0.591038,0.941951,0.332639,0.662829,0.946096,0.852995
24,0.024585,0.849136,0.585678,0.349135,0.533524,0.169328,0.854291,0.536717,0.198999,0.333392,0.475073,0.907176,0.843094,0.377074,0.579232,0.227286,0.338945,0.035416,0.342665,0.670618
25,0.521505,0.694153,0.830162,0.589872,0.402520,0.643594,0.133591,0.792379,0.663642,0.944310,0.350606,0.020354,0.660610,0.098161,0.635004,0.770425,0.922220,0.308834,0.471113,0.410935
26,0.740281,0.198614,0.153346,0.042982,0.320679,0.650875,0.206936,0.747347,0.892586,0.555071,0.825491,0.473986,0.281992,0.150296,0.032562,0.416954,0.324209,0.504884,0.631858,0.529184
27,0.984388,0.551156,0.225863,0.849215,0.355392,0.814772,0.329852,0.097210,0.368941,0.066127,0.072739,0.009383,0.141713,0.178087,0.565851,0.922919,0.140851,0.070313,0.157199,0.557703
28,0.870486,0.044654,0.661723,0.039599,0.491931,0.149696,0.722917,0.042044,0.429255,0.114185,0.967261,0.531346,0.809449,0.946455,0.691023,0.713613,0.477552,0.957500,0.074957,0.944704
29,0.418416,0.445399,0.484800,0.150621,0.305505,0.803178,0.868564,0.651822,0.897641,0.856321,0.842622,0.765033,0.107004,0.848272,0.476122,0.334103,0.212741,0.148335,0.020823,0.047493
30,0.128454,0.228597,0.072550,0.662659,0.555792,0.120484,0.793610,0.510643,0.632568,0.507994,0.140642,0.638814,0.480023,0.402503,0.615201,0.624560,0.640783,0.638490,0.166992,0.362085
31,0.206466,0.159218,0.269211,0.800442,0.436171,0.118581,0.368664,0.126166,0.515494,0.149131,0.356406,0.431312,0.776196,0.327842,0.552235,0.293175,0.017885,0.282621,0.736746,0.711098
32,0.020830,0.448406,0.899329,0.565467,0.806632,0.445238,0.774411,0.429686,0.094994,0.965840,0.012186,0.574338,0.521569,0.069218,0.224874,0.866502,0.048776,0.997217,0.086856,0.593100
33,0.816408,0.222804,0.040138,0.439654,0.186597,0.092685,0.103996,0.785844,0.687935,0.774624,0.214880,0.583777,0.366414,0.462778,0.932852,0.095531,0.992471,0.784483,0.345511,0.230726
34,0.098668,0.203138,0.619109,0.777481,0.608906,0.075387,0.321081,0.274153,0.978755,0.811092,0.772106,0.491083,0.100812,0.291954,0.780757,0.520413,0.242953,0.184342,0.056598,0.507466
35,0.694066,0.000589,0.124608,0.461736,0.543054,0.430033,0.401831,0.677775,0.401517,0.623028,0.505001,0.506807,0.380373,0.513862,0.581923,0.855135,0.672281,0.952299,0.292657,0.582257
36,0.418197,0.445232,0.314204,0.434767,0.520306,0.508244,0.935364,0.512758,0.056713,0.803105,0.906572,0.765717,0.762784,0.658723,0.098678,0.682139,0.342657,0.780591,0.302535,0.669381
37,0.456183,0.080782,0.534945,0.652445,0.818494,0.830276,0.133780,0.939780,0.708829,0.520248,0.937091,0.249124,0.165230,0.411566,0.494374,0.786062,0.091603,0.310609,0.784992,0.423527
38,0.741650,0.438337,0.254736,0.281962,0.545283,0.176821,0.808389,0.319918,0.290267,0.239548,0.602829,0.139542,0.814421,0.086883,0.288418,0.691807,0.476814,0.026802,0.710410,0.507192
39,0.377455,0.459911,0.050321,0.461166,0.650232,0.568317,0.482252,0.241695,0.985946,0.085780,0.596310,0.274215,0.258177,0.967885,0.804814,0.505927,0.994137,0.386341,0.783687,0.472933
40,0.082981,0.052836,0.130348,0.549169,0.308508,0.089138,0.860498,0.801325,0.552718,0.027101,0.008124,0.889739,0.805828,0.839259,0.833243,0.009810,0.721056,0.323019,0.029278,0.052206
41,0.977281,0.713811,0.016164,0.638592,0.155581,0.810028,0.749011,0.625433,0.420835,0.122615,0.688293,0.163399,0.604469,0.404912,0.304389,0.231944,0.871883,0.261638,0.928778,0.089998
42,0.092362,0.270417,0.984362,0.337993,0.460793,0.121748,0.833731,0.726732,0.343255,0.801768,0.890601,0.546914,0.712458,0.994821,0.867166,0.090390,0.748438,0.659239,0.787396,0.449722
43,0.309776,0.434793,0.926231,0.078090,0.265121,0.258449,0.859303,0.535792,0.416291,0.269410,0.047309,0.001860,0.910371,0.378930,0.960737,0.758891,0.323773,0.239190,0.003791,0.709495
44,0.385704,0.161497,0.489240,0.995308,0.125897,0.106113,0.982991,0.025852,0.891482,0.095108,0.547023,0.512464,0.849867,0.465614,0.976789,0.087923,0.581957,0.684961,0.931963,0.161084
45,0.725146,0.844997,0.924907,0.363416,0.020637,0.812507,0.583307,0.733223,0.910131,0.773319,0.863921,0.722406,0.376562,0.903837,0.850619,0.541460,0.015949,0.229572,0.082662,0.986594
46,0.732801,0.764710,0.001225,0.239535,0.051213,0.181404,0.574336,0.647143,0.843683,0.743183,0.124523,0.871903,0.080503,0.885656,0.671596,0.601816,0.694158,0.819646,0.497405,0.550096
47,0.214895,0.027611,0.859219,0.226858,0.952952,0.264914,0.670280,0.567887,0.543468,0.227177,0.594981,0.704586,0.401577,0.957012,0.329956,0.426028,0.413271,0.887770,0.291385,0.772291
48,0.021794,0.859277,0.732560,0.980648,0.654319,0.658216,0.343106,0.541862,0.669420,0.691287,0.504719,0.238514,0.244864,0.489557,0.584032,0.496344,0.984486,0.217075,0.437881,0.589848
49,0.028231,0.842177,0.056628,0.345595,0.961383,0.817327,0.243126,0.387753,0.065557,0.093646,0.036340,0.007331,0.610800,0.732711,0.774314,0.781573,0.704452,0.679412,0.348003,0.849056

In [13]:
df

    Name Age
0  Uzair  20
1  Abbas  19
2  Lahad  21
3   Razi  22
4  Bilal  19

In [14]:
# how to rename column names
df=pd.DataFrame({'A col ':[1,2,3,4,5],'B col ': [20,19,18,17,16]})

In [15]:
df.rename(columns={'A col': 'a col','B col':'b col'}, inplace=True)

In [16]:
df

   A col   B col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [17]:
df.columns=['aa_col','bb_col']

In [18]:
df

   aa_col  bb_col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [19]:
# to replace any character, string, lateral
df.columns=df.columns.str.replace('_',' ')

In [20]:
df

   aa col  bb col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [21]:
# adding prefix
df.add_prefix('UHS_')

   UHS_aa col  UHS_bb col
0           1          20
1           2          19
2           3          18
3           4          17
4           5          16

In [22]:
# adding suffix
df.add_suffix('_UHS')

   aa col_UHS  bb col_UHS
0           1          20
1           2          19
2           3          18
3           4          17
4           5          16

# 4 using template data

In [23]:
import pandas as pd
import numpy as np
import seaborn as sns

kashti = sns.load_dataset('titanic')
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [24]:
#  summary
kashti.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [25]:
# cloumns names
kashti.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [26]:
# saving a template dataset

kashti.to_csv('kashti.csv')

In [27]:
# saving to excel
kashti.to_excel('kashti.xlsx')

In [28]:
# viewing csv file
kashti=pd.read_csv('kashti.csv')
kashti

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [29]:
# reading excel file
kashti=pd.read_excel('kashti.xlsx')
kashti

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [30]:
# to text file
kashti.to_csv('kashti.txt',sep='\t')

In [31]:
#  reading text file
kashti=pd.read_csv('kashti.txt',sep='\t')
kashti

,Unnamed: 0.1,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

# 5 using your own data

In [32]:
import pandas as pd
df = pd.read_csv('database.csv')
df

,Date,Time,Latitude,Longitude,Type,Depth,Depth Error,Depth Seismic Stations,Magnitude,Magnitude Type,...,Magnitude Seismic Stations,Azimuthal Gap,Horizontal Distance,Horizontal Error,Root Mean Square,ID,Source,Location Source,Magnitude Source,Status
0,01/02/1965,13:44:18,19.2460,145.6160,Earthquake,131.60,NaN,NaN,6.0,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860706,ISCGEM,ISCGEM,ISCGEM,Automatic
1,01/04/1965,11:29:49,1.8630,127.3520,Earthquake,80.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860737,ISCGEM,ISCGEM,ISCGEM,Automatic
2,01/05/1965,18:05:58,-20.5790,-173.9720,Earthquake,20.00,NaN,NaN,6.2,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860762,ISCGEM,ISCGEM,ISCGEM,Automatic
3,01/08/1965,18:49:43,-59.0760,-23.5570,Earthquake,15.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860856,ISCGEM,ISCGEM,ISCGEM,Automatic
4,01/09/1965,13:32:50,11.9380,126.4270,Earthquake,15.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860890,ISCGEM,ISCGEM,ISCGEM,Automatic
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23407,12/28/2016,08:22:12,38.3917,-118.8941,Earthquake,12.30,1.2,40.0,5.6,ML,...,18.0,42.47,0.120,NaN,0.1898,NN00570710,NN,NN,NN,Reviewed
23408,12/28/2016,09:13:47,38.3777,-118.8957,Earthquake,8.80,2.0,33.0,5.5,ML,...,18.0,48.58,0.129,NaN,0.2187,NN00570744,NN,NN,NN,Reviewed
23409,12/28/2016,12:38:51,36.9179,140.4262,Earthquake,10.00,1.8,NaN,5.9,MWW,...,NaN,91.00,0.992,4.8,1.5200,US10007NAF,US,US,US,Reviewed
23410,12/29/2016,22:30:19,-9.0283,118.6639,Earthquake,79.00,1.8,NaN,6.3,MWW,...,NaN,26.00,3.553,6.0,1.4300,US10007NL0,US,US,US,Reviewed
23411,12/30/2016,20:08:28,37.3973,141.4103,Earthquake,11.94,2.2,NaN,5.5,MB,...,428.0,97.00,0.681,4.5,0.9100,US10007NTD,US,US,US,Reviewed

In [33]:
df.head()

,Date,Time,Latitude,Longitude,Type,Depth,Depth Error,Depth Seismic Stations,Magnitude,Magnitude Type,...,Magnitude Seismic Stations,Azimuthal Gap,Horizontal Distance,Horizontal Error,Root Mean Square,ID,Source,Location Source,Magnitude Source,Status
0,01/02/1965,13:44:18,19.246,145.616,Earthquake,131.6,NaN,NaN,6.0,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860706,ISCGEM,ISCGEM,ISCGEM,Automatic
1,01/04/1965,11:29:49,1.863,127.352,Earthquake,80.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860737,ISCGEM,ISCGEM,ISCGEM,Automatic
2,01/05/1965,18:05:58,-20.579,-173.972,Earthquake,20.0,NaN,NaN,6.2,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860762,ISCGEM,ISCGEM,ISCGEM,Automatic
3,01/08/1965,18:49:43,-59.076,-23.557,Earthquake,15.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860856,ISCGEM,ISCGEM,ISCGEM,Automatic
4,01/09/1965,13:32:50,11.938,126.427,Earthquake,15.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860890,ISCGEM,ISCGEM,ISCGEM,Automatic

# 6 reverse row order

In [34]:
import pandas as pd
import seaborn as sns

df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [35]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [36]:
# to check in descending order
df.loc[::-1].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [37]:
df.loc[::-1].reset_index(drop=True).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
1,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
2,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
3,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
4,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

# 7- reverse colun order

In [38]:
df.loc[:,::-1].head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0

# 8- select a cloumn by a data type

In [39]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [40]:
# only select those having numeric datatype

df.select_dtypes(include=['number']).head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [41]:
#  those with float
df.select_dtypes(include=['float']).head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [42]:
#  those with object
df.select_dtypes(include=['object']).head()

      sex embarked    who  embark_town alive
0    male        S    man  Southampton    no
1  female        C  woman    Cherbourg   yes
2  female        S  woman  Southampton   yes
3  female        S  woman  Southampton   yes
4    male        S    man  Southampton    no

In [43]:
#  those with multiple datatypes
df.select_dtypes(include=['float','number','object']).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,man,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,woman,Cherbourg,yes
2,1,3,female,26.0,0,0,7.9250,S,woman,Southampton,yes
3,1,1,female,35.0,1,0,53.1000,S,woman,Southampton,yes
4,0,3,male,35.0,0,0,8.0500,S,man,Southampton,no

In [44]:
df.select_dtypes(exclude=['number']).head()

      sex embarked  class    who  adult_male deck  embark_town alive  alone
0    male        S  Third    man        True  NaN  Southampton    no  False
1  female        C  First  woman       False    C    Cherbourg   yes  False
2  female        S  Third  woman       False  NaN  Southampton   yes   True
3  female        S  First  woman       False    C  Southampton   yes  False
4    male        S  Third    man        True  NaN  Southampton    no   True

# 9- convert numbers into strings

In [45]:
# creating a dataframe
df = pd.DataFrame({'col a' : ['1','2','3','4','5'],
                   'col b':['6','7','8','9','10']})
df

  col a col b
0     1     6
1     2     7
2     3     8
3     4     9
4     5    10

In [46]:
df.dtypes

col a    object
col b    object
dtype: object

In [47]:
# changing datatype to numeric
pd.to_numeric(df['col a'],errors='coerce')
df.dtypes

col a    object
col b    object
dtype: object

In [48]:
#  changing type object to int
df=df.astype({'col a':'int','col b':'object'})

In [49]:
df.dtypes

col a     int32
col b    object
dtype: object

In [50]:
# changing datatype to numeric
df=pd.to_numeric(df['col b'],errors='coerce')

# 10- reduce dataframe size

In [51]:
df=sns.load_dataset('titanic')

In [52]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [53]:
#  checking the memory usage by this dataset in our computer
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 313.7 KB

In [54]:
# reducing the size by taking a fraction of whole dataset
df.sample(frac=0.1).shape

(89, 15)

In [55]:
#  taking 0.5 fraction of whole dataset
df.sample(frac=0.5).shape

(446, 15)

# 11- copy data from clipboard

In [56]:
# dataset download
import seaborn as sns
import pandas as pd

df=sns.load_dataset('titanic')
df.to_excel('kashti.xlsx')

In [57]:
# read clipboard in python
df=pd.read_clipboard()
df

Empty DataFrame
Columns: [https://www.canva.com/design/DAFkNdFGUzQ/7pwGBqDVeiDyOo80hNBnOw/edit?utm_content=DAFkNdFGUzQ&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton]
Index: []

# 12 - split data sets in two frames

In [58]:
# dataset download
import seaborn as sns
import pandas as pd

df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [59]:
len(df)

891

In [60]:
df.shape

(891, 15)

In [61]:
# we have one sample of data set
from random import random
kashti_1 = df.sample(frac=0.5,random_state=1)
kashti_1.shape

(446, 15)

In [62]:
#  then we just dropped taken dataset from whole dataset
kashti_2= df.drop(kashti_1.index)
kashti_2.shape

(445, 15)

In [63]:
kashti_1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False

In [64]:
kashti_2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

In [65]:
df.shape

(891, 15)

In [66]:
len(kashti_1) + len(kashti_2)

891

# 13 - joining dataset into one dataframe

In [67]:
df1=kashti_1.append(kashti_2)
df1.shape

C:\Users\Administrator\AppData\Local\Temp\ipykernel_5364\805721718.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1=kashti_1.append(kashti_2)

(891, 15)

# 14 - filtering a data set

In [68]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [69]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [71]:
df[df.sex=="male"]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [72]:
df[df.sex=="female"]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [73]:
df.age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [74]:
df.embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [76]:
df[(df.embarked=="S")].shape

(644, 15)

In [88]:
df[((df.embark_town=="Southampton") |
    (df.embark_town=="Queenstown")) & 
    (df.sex=="female")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [90]:
df[df.embark_town.isin(['Queenstown','Southampton'])].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [93]:
df[df.age > 30].shape
# df[df.age < 30].shape

(305, 15)

# 15 filtering by large categories

In [94]:
df.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [95]:
df.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [100]:
df.age.value_counts().nlargest(5)

24.0    30
22.0    27
18.0    26
19.0    25
28.0    25
Name: age, dtype: int64

In [103]:
counts= df.embark_town.value_counts()
counts.nlargest(3)

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [104]:
counts= df.who.value_counts()
counts.nlargest(3)

man      537
woman    271
child     83
Name: who, dtype: int64

In [107]:
df[df.who.isin(counts.nlargest(1).index)].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# 16 - splitting a string into multiple cloumns

In [121]:
#  import libraries
import pandas as pd

#  read dataset
df=pd.DataFrame({'Name':['Uzair Hussain','Mirza Abbas','Abdul Lahad','Razi Khanzada'],
                        'Location':['Karachi, Pakistan','Nawabshah, Pakistan','Dadu, Pakistan','Hyderabad, Pakistan']})
df

            Name             Location
0  Uzair Hussain    Karachi, Pakistan
1    Mirza Abbas  Nawabshah, Pakistan
2    Abdul Lahad       Dadu, Pakistan
3  Razi Khanzada  Hyderabad, Pakistan

In [126]:
# splitting into two columns
df[["first name","last name"]] = df.Name.str.split(' ',expand=True)

In [127]:
# printing those two columns as well
df

            Name             Location first name last name
0  Uzair Hussain    Karachi, Pakistan      Uzair   Hussain
1    Mirza Abbas  Nawabshah, Pakistan      Mirza     Abbas
2    Abdul Lahad       Dadu, Pakistan      Abdul     Lahad
3  Razi Khanzada  Hyderabad, Pakistan       Razi  Khanzada

In [128]:
# splitting location into two columns
df[["city","country"]] = df.Location.str.split(' ',expand=True)

In [130]:
# printing those two columns as well
df

,Name,Location,first name,last name,city,country
0,Uzair Hussain,"Karachi, Pakistan",Uzair,Hussain,"Karachi,",Pakistan
1,Mirza Abbas,"Nawabshah, Pakistan",Mirza,Abbas,"Nawabshah,",Pakistan
2,Abdul Lahad,"Dadu, Pakistan",Abdul,Lahad,"Dadu,",Pakistan
3,Razi Khanzada,"Hyderabad, Pakistan",Razi,Khanzada,"Hyderabad,",Pakistan